การประชุมครั้งที่ 2 (9/12/2568) 

ผู้เข้าร่วม
- 68030013 ตำแหน่ง เลขา
- 68030040 ตำแหน่ง กรรมการ
- 68030250 ตำแหน่ง ประธาน

ผู้ไม่ได้เข้าร่วม
- 68030090

วาระที่1 : เสนอไอเดียที่แต่ละคนคิดมา

กัญจณะ 
ไอเดีย :  เป็นแนวเกมคล้ายกับเกม fnaf เกี่ยวกับ Cybersecurity ที่เราจะรับบทเป็นคนคอยจัดการเรื่อง 
  Cybersecurity ของบริษัทนึง ซึ่งเราจะต้องคอยสังเกตความผิดปกติทางCyberที่เกิดขึ้นภายในบริษัท ซึ่งสามารถจัดการได้ผ่านหน้าจอเลย 
แพลตฟอร์ม : ยังไม่ได้คิด

วชิระพล : 
ไอเดีย : ทายสีตัวต้านทาน(สืบเนื่องมาจากครั้งที่แล้ว) ได้รับแรงบันดาลใจมาจากเกมแมพ Epic mini game  จากเกม roblox 
โดยนำความรู้เรื่องลำดับสีของตัวต้านทานมาใช้ในตัวเกม โดยมีชื่อเกมว่า “ Ressister The Color Challenge ท้าสู้ประลองสีตัวต้านทาน ” 
แพลตฟอร์ม : Roblox
ปัญหาที่เจอ :  
- เราต้องปั้นโมเดล 3D เยอะหากจะทำ
- มินิเกมส่วนใหญ่ค่อนข้างที่จะจำเจ วนแต่กับการเลือกช้อย
- มินิเกมเราค่อนข้างปรับใช้ได้น้อยและค่อนข้างจำเจ
- โหมดความยาก ถ้าเราจะพัฒนา จะต้องแบ่งแรงค์ 
  
วาระที่2 : เสนอความคิดเห็น
จิตรเทพ -  เป็นความท้าทายของทีมพัฒนาเพราะเกมในรูปแบบของมินิเกม จะต้องทำด่านหลายๆแบบเพื่อให้ไม่จำเจและสนุกด้วย 

กัญ - อาจจะต้องแบ่งเนื้อหาตามความแรงค์เลเวล เช่น ในแรงค์ที่ต่ำสุดเลเวล1 
เป็นการเรียนรู้เรื่องค่าของแต่ละสี แต่เมื่อถึงเลเวลที่ต้องเลื่อนแรงค์ก็จะมีการทำแบบทดสอบ 
  ในรูปแบบของลาสบอสเพื่อที่จะผ่านไปในแรงค์ถัดไป เป็นต้น

สรุปการประชุมครั้งที่2
ในการประชุมครั้งหน้า ให้สมาชิกทุกคนไปหาปัญหาที่ตัวเองสนใจมาเสสนอในการประชุมครั้งหน้า 
หาจากเอไอหรือประสบการณ์ หรือจากหนังสืออะไรก็ได้ และคิดไอเดียเกมและซอฟแวต์ที่ใช้ในการสร้างและการแก้ปัญหามาแบบคร่าวๆไม่ต้องลงลึก

กัญจณะ : เสนอไอเดียเกมเกี่ยวกับการป้องกันทางไซเบอร์
วชิระพล :  ไอเดียเกมทายสีตัวต้านทานบน Roblox 
	
หน้าที่ในการประชุมครั้งหน้า (16/9/2568)
- 68030013 ตำแหน่ง กรรมการ
- 68030040 ตำแหน่ง ประธาน
- 68030090 ตำแหน่ง กรรมการ
- 68030250 ตำแหน่ง เลขา

  จบการประชุม
